Revit 2027 API
Toposolid.RemoveExcavationBy Method
 Removes the excavation between the given element and the Toposolid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveExcavationBy(
	ElementId elementId
)
Public Sub RemoveExcavationBy (
	elementId As ElementId
)
public:
void RemoveExcavationBy(
	ElementId^ elementId
)
member RemoveExcavationBy :
        elementId : ElementId -> unit
Parameters
elementId ElementId
 Id of the element that already excavates the Toposolid.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The element is not supported for Toposolid excavation operations.
See Also
Reference
Toposolid Class
Autodesk.Revit.DB Namespace